// Підключаємо роутер до бек-енду
const express = require('express')
const router = express.Router()

// Підключіть файли роутів

// Підключіть інші файли роутів, якщо є
//======================================

router.get('/', function (req, res) {
  res.render('calc', {
    name: 'calc',
    component: [],
    title: 'Calc',
    data: {},
  })
})
//======================================
// Об'єднайте файли роутів за потреби

// Використовуйте інші файли роутів, якщо є

//======================================
// Експортуємо глобальний роутер
module.exports = router
